In [2]:
import pandas as pd
CCTV_Seoul = pd.read_csv('./data/01. Seoul_CCTV.csv', encoding='utf-8') #'.' 하위 폴더 / '..'상위 폴더 
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [3]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [4]:
CCTV_Seoul.columns[0]

'기관명'

In [5]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]: '구별'}, inplace=True) # inplace=True 변경 내용 저장
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [6]:
pop_Seoul = pd.read_excel('./data/01. Seoul_Population.xls')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017,합계,4220082,10124579,4957857,5166722,9857426,4830206,5027220,267153,127651,139502,2.34,1365126
3,2017,종로구,73594,164257,80094,84163,154770,75967,78803,9487,4127,5360,2.1,26182
4,2017,중구,60412,134593,66337,68256,125709,62253,63456,8884,4084,4800,2.08,21384

In [7]:
pop_Seoul = pd.read_excel('./data/01. Seoul_Population.xls',
                         header=2, 
                          usecols='B, D, G, J, N')
pop_Seoul.head()

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10124579  9857426  267153   1365126
1  종로구    164257   154770    9487     26182
2   중구    134593   125709    8884     21384
3  용산구    244444   229161   15283     36882
4  성동구    312711   304808    7903     41273

In [8]:
pop_Seoul.rename(columns={pop_Seoul.columns[0]: "구별",
                          pop_Seoul.columns[1]: "인구수",
                          pop_Seoul.columns[2]: "한국인",
                          pop_Seoul.columns[3]: "외국인",
                          pop_Seoul.columns[4]: "고령자",
                         },
                 inplace=True,                 
)
pop_Seoul.head()

    구별       인구수      한국인     외국인      고령자
0   합계  10124579  9857426  267153  1365126
1  종로구    164257   154770    9487    26182
2   중구    134593   125709    8884    21384
3  용산구    244444   229161   15283    36882
4  성동구    312711   304808    7903    41273

In [9]:
pop_Seoul.tail()

     구별     인구수     한국인    외국인    고령자
21  관악구  520929  503297  17632  70046
22  서초구  445401  441102   4299  53205
23  강남구  561052  556164   4888  65060
24  송파구  671173  664496   6677  76582
25  강동구  440359  436223   4136  56161

In [10]:
import numpy as np

In [11]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [12]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2013-01-01  2.085664  2.482772  1.812739 -0.937047
2013-01-02 -0.064819 -0.279249 -0.611628  0.103507
2013-01-03 -1.557707 -1.074615 -0.369694  0.818824
2013-01-04  0.451215  1.083176  0.003050 -0.757066
2013-01-05  0.707140 -0.875591  0.869547 -0.055462
2013-01-06  0.904954  0.126245  0.225235 -0.521336

In [14]:
df.head()

                   A         B         C         D
2013-01-01  2.085664  2.482772  1.812739 -0.937047
2013-01-02 -0.064819 -0.279249 -0.611628  0.103507
2013-01-03 -1.557707 -1.074615 -0.369694  0.818824
2013-01-04  0.451215  1.083176  0.003050 -0.757066
2013-01-05  0.707140 -0.875591  0.869547 -0.055462

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.421074  0.243790  0.321541 -0.224763
std    1.203280  1.341358  0.892559  0.648714
min   -1.557707 -1.074615 -0.611628 -0.937047
25%    0.064190 -0.726505 -0.276508 -0.698134
50%    0.579177 -0.076502  0.114142 -0.288399
75%    0.855501  0.843944  0.708469  0.063765
max    2.085664  2.482772  1.812739  0.818824

In [17]:
#데이터 정렬
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-01  2.085664  2.482772  1.812739 -0.937047
2013-01-04  0.451215  1.083176  0.003050 -0.757066
2013-01-06  0.904954  0.126245  0.225235 -0.521336
2013-01-02 -0.064819 -0.279249 -0.611628  0.103507
2013-01-05  0.707140 -0.875591  0.869547 -0.055462
2013-01-03 -1.557707 -1.074615 -0.369694  0.818824

In [18]:
df['A']

2013-01-01    2.085664
2013-01-02   -0.064819
2013-01-03   -1.557707
2013-01-04    0.451215
2013-01-05    0.707140
2013-01-06    0.904954
Freq: D, Name: A, dtype: float64

In [19]:
df[0:3]

                   A         B         C         D
2013-01-01  2.085664  2.482772  1.812739 -0.937047
2013-01-02 -0.064819 -0.279249 -0.611628  0.103507
2013-01-03 -1.557707 -1.074615 -0.369694  0.818824

In [20]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.064819 -0.279249 -0.611628  0.103507
2013-01-03 -1.557707 -1.074615 -0.369694  0.818824
2013-01-04  0.451215  1.083176  0.003050 -0.757066

In [21]:
df.loc[:, ['A', 'B']] #이름으로 지정

                   A         B
2013-01-01  2.085664  2.482772
2013-01-02 -0.064819 -0.279249
2013-01-03 -1.557707 -1.074615
2013-01-04  0.451215  1.083176
2013-01-05  0.707140 -0.875591
2013-01-06  0.904954  0.126245

In [22]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.451215  1.083176
2013-01-05  0.707140 -0.875591

In [23]:
df

                   A         B         C         D
2013-01-01  2.085664  2.482772  1.812739 -0.937047
2013-01-02 -0.064819 -0.279249 -0.611628  0.103507
2013-01-03 -1.557707 -1.074615 -0.369694  0.818824
2013-01-04  0.451215  1.083176  0.003050 -0.757066
2013-01-05  0.707140 -0.875591  0.869547 -0.055462
2013-01-06  0.904954  0.126245  0.225235 -0.521336

In [24]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  2.085664  2.482772  1.812739 -0.937047
2013-01-04  0.451215  1.083176  0.003050 -0.757066
2013-01-05  0.707140 -0.875591  0.869547 -0.055462
2013-01-06  0.904954  0.126245  0.225235 -0.521336

In [25]:
df[df > 0]

                   A         B         C         D
2013-01-01  2.085664  2.482772  1.812739       NaN
2013-01-02       NaN       NaN       NaN  0.103507
2013-01-03       NaN       NaN       NaN  0.818824
2013-01-04  0.451215  1.083176  0.003050       NaN
2013-01-05  0.707140       NaN  0.869547       NaN
2013-01-06  0.904954  0.126245  0.225235       NaN

In [26]:
df['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df

                   A         B         C         D      E
2013-01-01  2.085664  2.482772  1.812739 -0.937047    one
2013-01-02 -0.064819 -0.279249 -0.611628  0.103507    one
2013-01-03 -1.557707 -1.074615 -0.369694  0.818824    two
2013-01-04  0.451215  1.083176  0.003050 -0.757066  three
2013-01-05  0.707140 -0.875591  0.869547 -0.055462   four
2013-01-06  0.904954  0.126245  0.225235 -0.521336  three

In [27]:
df['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [28]:
df

                   A         B         C         D      E
2013-01-01  2.085664  2.482772  1.812739 -0.937047    one
2013-01-02 -0.064819 -0.279249 -0.611628  0.103507    one
2013-01-03 -1.557707 -1.074615 -0.369694  0.818824    two
2013-01-04  0.451215  1.083176  0.003050 -0.757066  three
2013-01-05  0.707140 -0.875591  0.869547 -0.055462   four
2013-01-06  0.904954  0.126245  0.225235 -0.521336  three

In [29]:
del df['E']
df

                   A         B         C         D
2013-01-01  2.085664  2.482772  1.812739 -0.937047
2013-01-02 -0.064819 -0.279249 -0.611628  0.103507
2013-01-03 -1.557707 -1.074615 -0.369694  0.818824
2013-01-04  0.451215  1.083176  0.003050 -0.757066
2013-01-05  0.707140 -0.875591  0.869547 -0.055462
2013-01-06  0.904954  0.126245  0.225235 -0.521336

In [30]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  2.085664  2.482772  1.812739 -0.937047
2013-01-02  2.020845  2.203523  1.201110 -0.833539
2013-01-03  0.463138  1.128908  0.831416 -0.014715
2013-01-04  0.914353  2.212084  0.834466 -0.771782
2013-01-05  1.621493  1.336494  1.704013 -0.827244
2013-01-06  2.526447  1.462739  1.929248 -1.348580

In [31]:
CCTV_Seoul['최근증가율'] = (
    (CCTV_Seoul['2014년'] + CCTV_Seoul['2015년'] + CCTV_Seoul['2016년']) / CCTV_Seoul['2013년도 이전'] * 100
)

CCTV_Seoul.sort_values(by='최근증가율', ascending=False).head()

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
22  종로구  1619        464    314    211    630  248.922414
9   도봉구   825        238    159     42    386  246.638655
12  마포구   980        314    118    169    379  212.101911
8   노원구  1566        542     57    451    516  188.929889
1   강동구  1010        379     99    155    377  166.490765

In [32]:
def plusminus(num):
    return 'plus' if num > 0 else 'minus'

In [33]:
df['A'].apply(plusminus)

2013-01-01     plus
2013-01-02    minus
2013-01-03    minus
2013-01-04     plus
2013-01-05     plus
2013-01-06     plus
Freq: D, Name: A, dtype: object

In [34]:
df['A'].apply(lambda num: 'plus' if num > 0 else 'minus')

2013-01-01     plus
2013-01-02    minus
2013-01-03    minus
2013-01-04     plus
2013-01-05     plus
2013-01-06     plus
Freq: D, Name: A, dtype: object

In [35]:
CCTV_Seoul.sort_values(by='소계', ascending=True).head()

     구별   소계  2013년도 이전  2014년  2015년  2016년       최근증가율
9   도봉구  825        238    159     42    386  246.638655
2   강북구  831        369    120    138    204  125.203252
5   광진구  878        573     78     53    174   53.228621
3   강서구  911        388    258    184     81  134.793814
24  중랑구  916        509    121    177    109   79.960707

In [36]:
CCTV_Seoul.sort_values(by='소계', ascending=False).head()

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
0   강남구  3238       1292    430    584    932  150.619195
18  양천구  2482       1843    142     30    467   34.671731
14  서초구  2297       1406    157    336    398   63.371266
4   관악구  2109        846    260    390    613  149.290780
21  은평구  2108       1138    224    278    468   85.237258

In [37]:
CCTV_Seoul['최근증가율'] = (
    (CCTV_Seoul['2014년'] + CCTV_Seoul['2015년'] + CCTV_Seoul['2016년']) / CCTV_Seoul['2013년도 이전'] * 100
)

CCTV_Seoul.sort_values(by='최근증가율', ascending=False).head()

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
22  종로구  1619        464    314    211    630  248.922414
9   도봉구   825        238    159     42    386  246.638655
12  마포구   980        314    118    169    379  212.101911
8   노원구  1566        542     57    451    516  188.929889
1   강동구  1010        379     99    155    377  166.490765

In [38]:
pop_Seoul['구별'].unique()

array(['합계', '종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구',
       '강북구', '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구',
       '금천구', '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구'],
      dtype=object)

In [40]:
pop_Seoul['외국인비율'] = pop_Seoul['외국인'] / pop_Seoul['인구수'] * 100
pop_Seoul['고령자비율'] = pop_Seoul['고령자'] / pop_Seoul['인구수'] * 100
pop_Seoul.head()

    구별       인구수      한국인     외국인      고령자     외국인비율      고령자비율
0   합계  10124579  9857426  267153  1365126  2.638658  13.483287
1  종로구    164257   154770    9487    26182  5.775705  15.939656
2   중구    134593   125709    8884    21384  6.600640  15.887899
3  용산구    244444   229161   15283    36882  6.252148  15.088118
4  성동구    312711   304808    7903    41273  2.527254  13.198448

In [41]:
pop_Seoul.sort_values(by='외국인', ascending=False).head()

      구별       인구수      한국인     외국인      고령자     외국인비율      고령자비율
0     합계  10124579  9857426  267153  1365126  2.638658  13.483287
19  영등포구    402024   368550   33474    53981  8.326369  13.427308
17   구로구    441559   410742   30817    58794  6.979135  13.315095
18   금천구    253491   235154   18337    34170  7.233787  13.479769
21   관악구    520929   503297   17632    70046  3.384722  13.446362

In [43]:
pop_Seoul.sort_values(by='고령자', ascending=False).head()

     구별       인구수      한국인     외국인      고령자     외국인비율      고령자비율
0    합계  10124579  9857426  267153  1365126  2.638658  13.483287
24  송파구    671173   664496    6677    76582  0.994825  11.410173
16  강서구    608255   601691    6564    76032  1.079153  12.500021
12  은평구    491202   486794    4408    74559  0.897390  15.178888
11  노원구    558075   554403    3672    74243  0.657976  13.303409